In [60]:
import pandas as pd

In [61]:
order_columns=['order_id','order_date','order_customer_id','order_status']

In [62]:
orders = pd.read_csv('orders.txt',names = order_columns)

In [63]:
orders

       order_id             order_date  order_customer_id     order_status
0             1  2013-07-25 00:00:00.0              11599           CLOSED
1             2  2013-07-25 00:00:00.0                256  PENDING_PAYMENT
2             3  2013-07-25 00:00:00.0              12111         COMPLETE
3             4  2013-07-25 00:00:00.0               8827           CLOSED
4             5  2013-07-25 00:00:00.0              11318         COMPLETE
...         ...                    ...                ...              ...
68878     68879  2014-07-09 00:00:00.0                778         COMPLETE
68879     68880  2014-07-13 00:00:00.0               1117         COMPLETE
68880     68881  2014-07-19 00:00:00.0               2518  PENDING_PAYMENT
68881     68882  2014-07-22 00:00:00.0              10000          ON_HOLD
68882     68883  2014-07-23 00:00:00.0               5533         COMPLETE

[68883 rows x 4 columns]

In [64]:
orders.columns

Index(['order_id', 'order_date', 'order_customer_id', 'order_status'], dtype='object')

In [65]:
orders.columns

Index(['order_id', 'order_date', 'order_customer_id', 'order_status'], dtype='object')

In [66]:
orders['order_status'].unique()

array(['CLOSED', 'PENDING_PAYMENT', 'COMPLETE', 'PROCESSING',
       'PAYMENT_REVIEW', 'PENDING', 'ON_HOLD', 'CANCELED',
       'SUSPECTED_FRAUD'], dtype=object)

In [67]:
orders.query('order_status=="COMPLETE"')

       order_id             order_date  order_customer_id order_status
2             3  2013-07-25 00:00:00.0              12111     COMPLETE
4             5  2013-07-25 00:00:00.0              11318     COMPLETE
5             6  2013-07-25 00:00:00.0               7130     COMPLETE
6             7  2013-07-25 00:00:00.0               4530     COMPLETE
14           15  2013-07-25 00:00:00.0               2568     COMPLETE
...         ...                    ...                ...          ...
68875     68876  2014-07-06 00:00:00.0               4124     COMPLETE
68877     68878  2014-07-08 00:00:00.0               6753     COMPLETE
68878     68879  2014-07-09 00:00:00.0                778     COMPLETE
68879     68880  2014-07-13 00:00:00.0               1117     COMPLETE
68882     68883  2014-07-23 00:00:00.0               5533     COMPLETE

[22899 rows x 4 columns]

In [68]:
orders.query('order_status=="COMPLETE" and order_date== "2014-01-01 00:00:00.0"' )

       order_id             order_date  order_customer_id order_status
25881     25882  2014-01-01 00:00:00.0               4598     COMPLETE
25887     25888  2014-01-01 00:00:00.0               6735     COMPLETE
25888     25889  2014-01-01 00:00:00.0              10045     COMPLETE
25894     25895  2014-01-01 00:00:00.0               1044     COMPLETE
25896     25897  2014-01-01 00:00:00.0               6405     COMPLETE
25897     25898  2014-01-01 00:00:00.0               3950     COMPLETE
25900     25901  2014-01-01 00:00:00.0               3099     COMPLETE
25901     25902  2014-01-01 00:00:00.0               6083     COMPLETE
25906     25907  2014-01-01 00:00:00.0               3603     COMPLETE
25912     25913  2014-01-01 00:00:00.0               9382     COMPLETE
25913     25914  2014-01-01 00:00:00.0               9288     COMPLETE
25914     25915  2014-01-01 00:00:00.0               2963     COMPLETE
25915     25916  2014-01-01 00:00:00.0               3219     COMPLETE
25917     25918  2014-01-01 00:00:00.0                279     COMPLETE
25918     25919  2014-01-01 00:00:00.0               3052     COMPLETE
25919     25920  2014-01-01 00:00:00.0              12232     COMPLETE
25920     25921  2014-01-01 00:00:00.0              12373     COMPLETE
25921     25922  2014-01-01 00:00:00.0                224     COMPLETE
25923     25924  2014-01-01 00:00:00.0               3826     COMPLETE
25925     25926  2014-01-01 00:00:00.0              10468     COMPLETE
25926     25927  2014-01-01 00:00:00.0              10278     COMPLETE
25932     25933  2014-01-01 00:00:00.0                859     COMPLETE
25933     25934  2014-01-01 00:00:00.0               4567     COMPLETE
25935     25936  2014-01-01 00:00:00.0               3057     COMPLETE
25938     25939  2014-01-01 00:00:00.0               8989     COMPLETE
25939     25940  2014-01-01 00:00:00.0               7812     COMPLETE
25947     25948  2014-01-01 00:00:00.0               3800     COMPLETE
25949     25950  2014-01-01 00:00:00.0               6954     COMPLETE
25954     25955  2014-01-01 00:00:00.0               4962     COMPLETE
25957     25958  2014-01-01 00:00:00.0              11124     COMPLETE
25958     25959  2014-01-01 00:00:00.0               3128     COMPLETE
25959     25960  2014-01-01 00:00:00.0               7918     COMPLETE
25961     25962  2014-01-01 00:00:00.0               5170     COMPLETE
25968     25969  2014-01-01 00:00:00.0               2144     COMPLETE
25969     25970  2014-01-01 00:00:00.0                387     COMPLETE
25977     25978  2014-01-01 00:00:00.0              11726     COMPLETE
25979     25980  2014-01-01 00:00:00.0                363     COMPLETE
25980     25981  2014-01-01 00:00:00.0               8500     COMPLETE
25983     25984  2014-01-01 00:00:00.0               5961     COMPLETE
25984     25985  2014-01-01 00:00:00.0               3727     COMPLETE
61897     61898  2014-01-01 00:00:00.0              10152     COMPLETE
61903     61904  2014-01-01 00:00:00.0                470     COMPLETE
61906     61907  2014-01-01 00:00:00.0              11258     COMPLETE
61907     61908  2014-01-01 00:00:00.0               5031     COMPLETE
61909     61910  2014-01-01 00:00:00.0              11201     COMPLETE
61912     61913  2014-01-01 00:00:00.0              12218     COMPLETE
61913     61914  2014-01-01 00:00:00.0               2956     COMPLETE

In [69]:
orders.query('order_status=="COMPLETE" or order_status == "CLOSED"')

       order_id             order_date  order_customer_id order_status
0             1  2013-07-25 00:00:00.0              11599       CLOSED
2             3  2013-07-25 00:00:00.0              12111     COMPLETE
3             4  2013-07-25 00:00:00.0               8827       CLOSED
4             5  2013-07-25 00:00:00.0              11318     COMPLETE
5             6  2013-07-25 00:00:00.0               7130     COMPLETE
...         ...                    ...                ...          ...
68875     68876  2014-07-06 00:00:00.0               4124     COMPLETE
68877     68878  2014-07-08 00:00:00.0               6753     COMPLETE
68878     68879  2014-07-09 00:00:00.0                778     COMPLETE
68879     68880  2014-07-13 00:00:00.0               1117     COMPLETE
68882     68883  2014-07-23 00:00:00.0               5533     COMPLETE

[30455 rows x 4 columns]

In [70]:
data = {'Name':['Alice','Bob'],'Age':[25,30]}
df=pd.DataFrame(data)
print(df)

    Name  Age
0  Alice   25
1    Bob   30

In [71]:
df=orders

In [72]:
df

       order_id             order_date  order_customer_id     order_status
0             1  2013-07-25 00:00:00.0              11599           CLOSED
1             2  2013-07-25 00:00:00.0                256  PENDING_PAYMENT
2             3  2013-07-25 00:00:00.0              12111         COMPLETE
3             4  2013-07-25 00:00:00.0               8827           CLOSED
4             5  2013-07-25 00:00:00.0              11318         COMPLETE
...         ...                    ...                ...              ...
68878     68879  2014-07-09 00:00:00.0                778         COMPLETE
68879     68880  2014-07-13 00:00:00.0               1117         COMPLETE
68880     68881  2014-07-19 00:00:00.0               2518  PENDING_PAYMENT
68881     68882  2014-07-22 00:00:00.0              10000          ON_HOLD
68882     68883  2014-07-23 00:00:00.0               5533         COMPLETE

[68883 rows x 4 columns]

In [73]:
df.head()

   order_id             order_date  order_customer_id     order_status
0         1  2013-07-25 00:00:00.0              11599           CLOSED
1         2  2013-07-25 00:00:00.0                256  PENDING_PAYMENT
2         3  2013-07-25 00:00:00.0              12111         COMPLETE
3         4  2013-07-25 00:00:00.0               8827           CLOSED
4         5  2013-07-25 00:00:00.0              11318         COMPLETE

In [74]:
df.tail()

       order_id             order_date  order_customer_id     order_status
68878     68879  2014-07-09 00:00:00.0                778         COMPLETE
68879     68880  2014-07-13 00:00:00.0               1117         COMPLETE
68880     68881  2014-07-19 00:00:00.0               2518  PENDING_PAYMENT
68881     68882  2014-07-22 00:00:00.0              10000          ON_HOLD
68882     68883  2014-07-23 00:00:00.0               5533         COMPLETE

In [75]:
df.dtypes

order_id              int64
order_date           object
order_customer_id     int64
order_status         object
dtype: object

In [76]:
status_count= df.groupby('order_status')['order_id'].count().reset_index()
print(status_count)

      order_status  order_id
0         CANCELED      1428
1           CLOSED      7556
2         COMPLETE     22899
3          ON_HOLD      3798
4   PAYMENT_REVIEW       729
5          PENDING      7610
6  PENDING_PAYMENT     15030
7       PROCESSING      8275
8  SUSPECTED_FRAUD      1558

In [77]:
print(df['order_status'].value_counts())

COMPLETE           22899
PENDING_PAYMENT    15030
PROCESSING          8275
PENDING             7610
CLOSED              7556
ON_HOLD             3798
SUSPECTED_FRAUD     1558
CANCELED            1428
PAYMENT_REVIEW       729
Name: order_status, dtype: int64

In [78]:
df['order_date'] = pd.to_datetime(df['order_date'])
df['Month'] = df['order_date'].dt.to_period('M')
count = df.groupby(['Month','order_status'])['order_id'].count().reset_index()
print(count)

       Month     order_status  order_id
0    2013-07         CANCELED        22
1    2013-07           CLOSED       161
2    2013-07         COMPLETE       515
3    2013-07          ON_HOLD        81
4    2013-07   PAYMENT_REVIEW        19
..       ...              ...       ...
112  2014-07   PAYMENT_REVIEW        54
113  2014-07          PENDING       517
114  2014-07  PENDING_PAYMENT       979
115  2014-07       PROCESSING       561
116  2014-07  SUSPECTED_FRAUD       101

[117 rows x 3 columns]

In [79]:
pivot = df.pivot_table(index='Month', columns = 'order_status' ,values= 'order_id', aggfunc= 'count')
print(pivot)

order_status  CANCELED  CLOSED  COMPLETE  ON_HOLD  PAYMENT_REVIEW  PENDING  \
Month
2013-07             22     161       515       81              19      161
2013-08            125     637      1880      300              55      661
2013-09            127     676      1933      315              65      641
2013-10             99     609      1783      288              49      565
2013-11            130     686      2141      362              63      713
2013-12            134     705      1898      305              57      639
2014-01            110     633      1911      365              77      635
2014-02            125     602      1869      308              57      650
2014-03            117     612      1967      323              69      605
2014-04            104     583      1932      333              52      590
2014-05            126     585      1854      309              54      610
2014-06            104     563      1797      281              58      623
2014-07            105     504      1419      228              54      517

order_status  PENDING_PAYMENT  PROCESSING  SUSPECTED_FRAUD
Month
2013-07                   353         188               33
2013-08                  1199         692              131
2013-09                  1260         676              148
2013-10                  1172         662              108
2013-11                  1422         714              150
2013-12                  1343         685              126
2014-01                  1334         712              131
2014-02                  1205         700              119
2014-03                  1233         714              138
2014-04                  1232         719              112
2014-05                  1174         625              130
2014-06                  1124         627              131
2014-07                   979         561              101

In [80]:
def get_colum_names(schemas, ds_name, sorting_key = 'column_position'):
    column_details = schemas[ds_name]
    columns = sorted(column_details, key =  lambda col : col[sorting_key])
    return [col['column_name'] for col in columns]

In [81]:
import json
schemas = json.load(open('schemas.json'))

In [82]:
order_columns = get_colum_names(schemas, 'orders')

In [83]:
orders= pd.read_csv('orders.txt' , names= order_columns)

In [84]:
customer_columns = get_colum_names(schemas, 'customers')

In [85]:
customer_columns

['customer_id',
 'customer_fname',
 'customer_lname',
 'customer_email',
 'customer_password',
 'customer_street',
 'customer_city',
 'customer_state',
 'customer_zipcode']

In [86]:
customers = pd.read_csv('customers.txt' , names = customer_columns)

In [87]:
orders

       order_id             order_date  customer_id     order_status
0             1  2013-07-25 00:00:00.0        11599           CLOSED
1             2  2013-07-25 00:00:00.0          256  PENDING_PAYMENT
2             3  2013-07-25 00:00:00.0        12111         COMPLETE
3             4  2013-07-25 00:00:00.0         8827           CLOSED
4             5  2013-07-25 00:00:00.0        11318         COMPLETE
...         ...                    ...          ...              ...
68878     68879  2014-07-09 00:00:00.0          778         COMPLETE
68879     68880  2014-07-13 00:00:00.0         1117         COMPLETE
68880     68881  2014-07-19 00:00:00.0         2518  PENDING_PAYMENT
68881     68882  2014-07-22 00:00:00.0        10000          ON_HOLD
68882     68883  2014-07-23 00:00:00.0         5533         COMPLETE

[68883 rows x 4 columns]

In [88]:
customers

,customer_id,customer_fname,customer_lname,customer_email,customer_password,customer_street,customer_city,customer_state,customer_zipcode
0,1,Richard,Hernandez,XXXXXXXXX,XXXXXXXXX,6303 Heather Plaza,Brownsville,TX,78521
1,2,Mary,Barrett,XXXXXXXXX,XXXXXXXXX,9526 Noble Embers Ridge,Littleton,CO,80126
2,3,Ann,Smith,XXXXXXXXX,XXXXXXXXX,3422 Blue Pioneer Bend,Caguas,PR,725
3,4,Mary,Jones,XXXXXXXXX,XXXXXXXXX,8324 Little Common,San Marcos,CA,92069
4,5,Robert,Hudson,XXXXXXXXX,XXXXXXXXX,10 Crystal River Mall,Caguas,PR,725
...,...,...,...,...,...,...,...,...,...
12430,12431,Mary,Rios,XXXXXXXXX,XXXXXXXXX,1221 Cinder Pines,Kaneohe,HI,96744
12431,12432,Angela,Smith,XXXXXXXXX,XXXXXXXXX,1525 Jagged Barn Highlands,Caguas,PR,725
12432,12433,Benjamin,Garcia,XXXXXXXXX,XXXXXXXXX,5459 Noble Brook Landing,Levittown,NY,11756
12433,12434,Mary,Mills,XXXXXXXXX,XXXXXXXXX,9720 Colonial Parade,Caguas,PR,725
12434,12435,Laura,Horton,XXXXXXXXX,XXXXXXXXX,5736 Honey Downs,Summerville,SC,29483

In [89]:
customers

,customer_id,customer_fname,customer_lname,customer_email,customer_password,customer_street,customer_city,customer_state,customer_zipcode
0,1,Richard,Hernandez,XXXXXXXXX,XXXXXXXXX,6303 Heather Plaza,Brownsville,TX,78521
1,2,Mary,Barrett,XXXXXXXXX,XXXXXXXXX,9526 Noble Embers Ridge,Littleton,CO,80126
2,3,Ann,Smith,XXXXXXXXX,XXXXXXXXX,3422 Blue Pioneer Bend,Caguas,PR,725
3,4,Mary,Jones,XXXXXXXXX,XXXXXXXXX,8324 Little Common,San Marcos,CA,92069
4,5,Robert,Hudson,XXXXXXXXX,XXXXXXXXX,10 Crystal River Mall,Caguas,PR,725
...,...,...,...,...,...,...,...,...,...
12430,12431,Mary,Rios,XXXXXXXXX,XXXXXXXXX,1221 Cinder Pines,Kaneohe,HI,96744
12431,12432,Angela,Smith,XXXXXXXXX,XXXXXXXXX,1525 Jagged Barn Highlands,Caguas,PR,725
12432,12433,Benjamin,Garcia,XXXXXXXXX,XXXXXXXXX,5459 Noble Brook Landing,Levittown,NY,11756
12433,12434,Mary,Mills,XXXXXXXXX,XXXXXXXXX,9720 Colonial Parade,Caguas,PR,725
12434,12435,Laura,Horton,XXXXXXXXX,XXXXXXXXX,5736 Honey Downs,Summerville,SC,29483

In [90]:
customers = customers.set_index('customer_id')

In [91]:
customers

,customer_fname,customer_lname,customer_email,customer_password,customer_street,customer_city,customer_state,customer_zipcode
customer_id,,,,,,,,
1,Richard,Hernandez,XXXXXXXXX,XXXXXXXXX,6303 Heather Plaza,Brownsville,TX,78521
2,Mary,Barrett,XXXXXXXXX,XXXXXXXXX,9526 Noble Embers Ridge,Littleton,CO,80126
3,Ann,Smith,XXXXXXXXX,XXXXXXXXX,3422 Blue Pioneer Bend,Caguas,PR,725
4,Mary,Jones,XXXXXXXXX,XXXXXXXXX,8324 Little Common,San Marcos,CA,92069
5,Robert,Hudson,XXXXXXXXX,XXXXXXXXX,10 Crystal River Mall,Caguas,PR,725
...,...,...,...,...,...,...,...,...
12431,Mary,Rios,XXXXXXXXX,XXXXXXXXX,1221 Cinder Pines,Kaneohe,HI,96744
12432,Angela,Smith,XXXXXXXXX,XXXXXXXXX,1525 Jagged Barn Highlands,Caguas,PR,725
12433,Benjamin,Garcia,XXXXXXXXX,XXXXXXXXX,5459 Noble Brook Landing,Levittown,NY,11756
12434,Mary,Mills,XXXXXXXXX,XXXXXXXXX,9720 Colonial Parade,Caguas,PR,725
12435,Laura,Horton,XXXXXXXXX,XXXXXXXXX,5736 Honey Downs,Summerville,SC,29483

In [92]:
orders

       order_id             order_date  customer_id     order_status
0             1  2013-07-25 00:00:00.0        11599           CLOSED
1             2  2013-07-25 00:00:00.0          256  PENDING_PAYMENT
2             3  2013-07-25 00:00:00.0        12111         COMPLETE
3             4  2013-07-25 00:00:00.0         8827           CLOSED
4             5  2013-07-25 00:00:00.0        11318         COMPLETE
...         ...                    ...          ...              ...
68878     68879  2014-07-09 00:00:00.0          778         COMPLETE
68879     68880  2014-07-13 00:00:00.0         1117         COMPLETE
68880     68881  2014-07-19 00:00:00.0         2518  PENDING_PAYMENT
68881     68882  2014-07-22 00:00:00.0        10000          ON_HOLD
68882     68883  2014-07-23 00:00:00.0         5533         COMPLETE

[68883 rows x 4 columns]

In [93]:
orders = orders.set_index('customer_id')

In [94]:
customer_orders = customers.join(orders, how='inner')

In [95]:
customer_orders.head()

,customer_fname,customer_lname,customer_email,customer_password,customer_street,customer_city,customer_state,customer_zipcode,order_id,order_date,order_status
customer_id,,,,,,,,,,,
1,Richard,Hernandez,XXXXXXXXX,XXXXXXXXX,6303 Heather Plaza,Brownsville,TX,78521,22945,2013-12-13 00:00:00.0,COMPLETE
2,Mary,Barrett,XXXXXXXXX,XXXXXXXXX,9526 Noble Embers Ridge,Littleton,CO,80126,15192,2013-10-29 00:00:00.0,PENDING_PAYMENT
2,Mary,Barrett,XXXXXXXXX,XXXXXXXXX,9526 Noble Embers Ridge,Littleton,CO,80126,33865,2014-02-18 00:00:00.0,COMPLETE
2,Mary,Barrett,XXXXXXXXX,XXXXXXXXX,9526 Noble Embers Ridge,Littleton,CO,80126,57963,2013-08-02 00:00:00.0,ON_HOLD
2,Mary,Barrett,XXXXXXXXX,XXXXXXXXX,9526 Noble Embers Ridge,Littleton,CO,80126,67863,2013-11-30 00:00:00.0,COMPLETE

In [96]:
result = pd.merge(customers, orders, on='customer_id', how='inner')
print(result.head())

            customer_fname customer_lname customer_email customer_password  \
customer_id
1                  Richard      Hernandez      XXXXXXXXX         XXXXXXXXX
2                     Mary        Barrett      XXXXXXXXX         XXXXXXXXX
2                     Mary        Barrett      XXXXXXXXX         XXXXXXXXX
2                     Mary        Barrett      XXXXXXXXX         XXXXXXXXX
2                     Mary        Barrett      XXXXXXXXX         XXXXXXXXX

                     customer_street customer_city customer_state  \
customer_id
1                 6303 Heather Plaza   Brownsville             TX
2            9526 Noble Embers Ridge     Littleton             CO
2            9526 Noble Embers Ridge     Littleton             CO
2            9526 Noble Embers Ridge     Littleton             CO
2            9526 Noble Embers Ridge     Littleton             CO

             customer_zipcode  order_id             order_date  \
customer_id
1                       78521     22945  2013-12-13 00:00:00.0
2                       80126     15192  2013-10-29 00:00:00.0
2                       80126     33865  2014-02-18 00:00:00.0
2                       80126     57963  2013-08-02 00:00:00.0
2                       80126     67863  2013-11-30 00:00:00.0

                order_status
customer_id
1                   COMPLETE
2            PENDING_PAYMENT
2                   COMPLETE
2                    ON_HOLD
2                   COMPLETE

In [97]:
customer_orders['value'] = customer_orders.index * customer_orders['order_id']
agg = customer_orders.groupby('customer_fname')['value'].sum().reset_index()
print(agg.head())

  customer_fname        value
0          Aaron  41558620867
1           Adam  23213466561
2           Alan  21428017059
3         Albert  21340005129
4      Alexander  44789048580

In [100]:
def get_colum_names(schemas, ds_name, sorting_key = 'column_position'):
    column_details = schemas[ds_name]
    columns = sorted(column_details, key =  lambda col : col[sorting_key])
    return [col['column_name'] for col in columns]

In [101]:
import json
schemas = json.load(open('schemas.json'))

In [103]:
order_items = (schemas, 'order_items')

In [105]:
column_name = get_colum_names(schemas ,'order_items')

In [113]:
orderitems = pd.read_csv('order_items.txt', names = column_name)
orderitems.head()

,order_item_id,order_item_order_id,order_item_product_id,order_item_quantity,order_item_subtotal,order_item_product_price
0,1,1,957,1,299.98,299.98
1,2,2,1073,1,199.99,199.99
2,3,2,502,5,250.00,50.00
3,4,2,403,1,129.99,129.99
4,5,4,897,2,49.98,24.99

In [114]:
products_name = (schemas ,'products')

In [115]:
column_products = get_colum_names(schemas , 'products')

In [117]:
products = pd.read_csv('products.txt',names = column_products)
products.head()

,product_id,product_cateogry_id,product_name,product_description,product_price,product_image
0,1,2,Quest Q64 10 FT. x 10 FT. Slant Leg Instant U,NaN,59.98,http://images.acmesports.sports/Quest+Q64+10+F...
1,2,2,Under Armour Men's Highlight MC Football Clea,NaN,129.99,http://images.acmesports.sports/Under+Armour+M...
2,3,2,Under Armour Men's Renegade D Mid Football Cl,NaN,89.99,http://images.acmesports.sports/Under+Armour+M...
3,4,2,Under Armour Men's Renegade D Mid Football Cl,NaN,89.99,http://images.acmesports.sports/Under+Armour+M...
4,5,2,Riddell Youth Revolution Speed Custom Footbal,NaN,199.99,http://images.acmesports.sports/Riddell+Youth+...

In [127]:
orderitems = orderitems.set_index('order_item_product_id')

In [ ]:
products = products.set_index('product_id')

In [124]:
products

,product_cateogry_id,product_name,product_description,product_price,product_image
product_id,,,,,
1,2,Quest Q64 10 FT. x 10 FT. Slant Leg Instant U,NaN,59.98,http://images.acmesports.sports/Quest+Q64+10+F...
2,2,Under Armour Men's Highlight MC Football Clea,NaN,129.99,http://images.acmesports.sports/Under+Armour+M...
3,2,Under Armour Men's Renegade D Mid Football Cl,NaN,89.99,http://images.acmesports.sports/Under+Armour+M...
4,2,Under Armour Men's Renegade D Mid Football Cl,NaN,89.99,http://images.acmesports.sports/Under+Armour+M...
5,2,Riddell Youth Revolution Speed Custom Footbal,NaN,199.99,http://images.acmesports.sports/Riddell+Youth+...
...,...,...,...,...,...
1341,59,Nike Women's Cleveland Browns Johnny Football,NaN,34.00,http://images.acmesports.sports/Nike+Women%27s...
1342,59,Nike Men's St. Louis Rams Michael Sam #96 Nam,NaN,32.00,http://images.acmesports.sports/Nike+Men%27s+S...
1343,59,Nike Men's Home Game Jersey St. Louis Rams Mi,NaN,100.00,http://images.acmesports.sports/Nike+Men%27s+H...
1344,59,Nike Men's Home Game Jersey St. Louis Rams Aa,NaN,100.00,http://images.acmesports.sports/Nike+Men%27s+H...
1345,59,Nike Men's Home Game Jersey St. Louis Rams Gr,NaN,100.00,http://images.acmesports.sports/Nike+Men%27s+H...

In [130]:
orderitems

,order_item_id,order_item_order_id,order_item_quantity,order_item_subtotal,order_item_product_price
order_item_product_id,,,,,
957,1,1,1,299.98,299.98
1073,2,2,1,199.99,199.99
502,3,2,5,250.00,50.00
403,4,2,1,129.99,129.99
897,5,4,2,49.98,24.99
...,...,...,...,...,...
403,172194,68881,1,129.99,129.99
365,172195,68882,1,59.99,59.99
502,172196,68882,1,50.00,50.00
208,172197,68883,1,1999.99,1999.99
502,172198,68883,3,150.00,50.00

In [131]:
join_prod_order = orderitems.join(products, how='inner')
join_prod_order.head()

,order_item_id,order_item_order_id,order_item_quantity,order_item_subtotal,order_item_product_price,product_cateogry_id,product_name,product_description,product_price,product_image
19,144776,57864,1,124.99,124.99,2,Nike Men's Fingertrap Max Training Shoe,NaN,124.99,http://images.acmesports.sports/Nike+Men%27s+F...
19,145164,58018,1,124.99,124.99,2,Nike Men's Fingertrap Max Training Shoe,NaN,124.99,http://images.acmesports.sports/Nike+Men%27s+F...
19,146401,58491,1,124.99,124.99,2,Nike Men's Fingertrap Max Training Shoe,NaN,124.99,http://images.acmesports.sports/Nike+Men%27s+F...
19,146472,58522,1,124.99,124.99,2,Nike Men's Fingertrap Max Training Shoe,NaN,124.99,http://images.acmesports.sports/Nike+Men%27s+F...
19,146941,58707,1,124.99,124.99,2,Nike Men's Fingertrap Max Training Shoe,NaN,124.99,http://images.acmesports.sports/Nike+Men%27s+F...

In [132]:
join_prod_order['TotalValue'] = join_prod_order['order_item_quantity'] * join_prod_order['order_item_product_price']
agg = join_prod_order.groupby('order_item_id')['TotalValue'].sum().reset_index()
print(agg.head(10))

   order_item_id  TotalValue
0              1      299.98
1              2      199.99
2              3      250.00
3              4      129.99
4              5       49.98
5              6      299.95
6              7      150.00
7              8      199.92
8              9      299.98
9             10      299.95